CREATE TABLE books (
	id SERIAL PRIMARY KEY,
	author VARCHAR(255) NOT NULL,
	bookname VARCHAR(255) NOT NULL,
	isbn CHAR(13) UNIQUE NOT NULL,
	numberOfPages INT,
	price DECIMAL(20, 2),
	year INT
)

INSERT INTO books (author, bookname, isbn, numberofpages, price, year)
VALUES
	('Дж.Р.Р.Толкин', 'Властелин колец', 9780544003415, 1216, 6.50, 1954),
	('Джордж Мартин', 'Игра престолов', 9780553103540, 694, 5.85, 1996),
	('Стивен Кинг', 'Мизери', 9780451168605, 428, 4.55, 1987),
	('Джон Гришэм', 'Последний дракон', 9780345535287, 800, 5.20, 1996),
	('Джеймс Сэйлор', 'Аватар: Легенда об Аанге', 9781416910290, 352, 3.90, 2005),
	('Дэн Браун', 'Код да Винчи', 9780307474278, 489, 7.80, 2003),
	('Маргарет Этвуд', 'Хранитель времени', 9780679720201, 544, 7.15, 1985),
	('Джон Стейнбек', 'Гроздья гнева', 9780143039438, 464, 3.90, 1939),
	('Джон Гришэм', 'Ветер сквозь меч', 9780345535294, 800, 5.20, 1997),
	('Джордж Мартин', 'Танец с драконами', 9780553108039, 864, 5.85, 2011),
	('Чак Паланик', 'Бойцовский клуб', 9780393327342, 224, 8.90, 1996),
	('Дэн Браун', 'Ангелы и демоны', 9780743493469, 528, 8.45, 2010),
	('Габриэль Гарсиа Маркес', 'Сто лет одиночества', 9780060883287, 417, 7.99, 1967),
	('Джон Стейнбек', 'О мышах и людях', 9780141185101, 224, 3.25, 1937),
	('Джон Гришэм', 'Ледяной сон', 9780099537094, 800, 5.20, 1998),
	('Джордж Мартин', 'Буря мечей', 9780553106633, 864, 5.85, 2000),
	('Владимир Набоков', 'Лолита', 9780679723165, 317, 7.50, 1955),
	('Дэн Браун', 'Другой день', 9780804172264, 528, 8.45, 2011),
	('Мэри Шелли', 'Франкенштейн', 9780486282114, 166, 3.80, 1818),
	('Федор Достоевский', 'Преступление и наказание', 9780143107637, 671, 9.50, 1866),
	('Джоан Роулинг', 'Гарри Поттер и философский камень', 9780747532699, 223, 7.10, 1997),
	('Джейн Остин', 'Гордость и предубеждение', 9781503290563, 279, 6.70, 1813),
	('Марио Пьюзо', 'Крестный отец', 9780451205766, 448, 6.99, 1969),
	('Джордж Оруэлл', '1984', 9780451524935, 328, 7.80, 1949),
	('Лев Толстой', 'Война и мир', 9780307292062, 1225, 15.00, 1869)